#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ansible_role_terraform.github_repository.repo: Refreshing state... [id=ansible-role-terraform]
module.ansible_role_k8s-node.github_repository.repo: Refreshing state... [id=ansible-role-k8s-node]
module.ansible_role_k8s-certificates.github_repository.repo: Refreshing state... [id=ansible-role-k8s-certificates]
module.ansible_role_cryptominer.github_repository.repo: Refreshing state... [id=ansible-role-cryptominer]
module.ansible_role_vagrant.github_repository.repo: Refreshing state... [id=ansible-role-vagrant]
module.terraform_module_repos["terraform-azurerm-github-repos"].github_repository.repo: Refreshing state... [id=terraform-azurerm-github-repos]
module.terraform_module_repos["terraform-azurerm-o365dns"].github_repository.repo: Refreshing state... [id=terraform-azurerm-o365dns]
module.terraform_module_repos["terraform-module-scaffolding"].github_repository.repo: Refreshing state... [id=terraform-module-scaffolding]
module.ansible_role_zsh.github_repository.repo: Refreshing state... [id=ansible-role-zsh]
github_actions_secret.tf_api_token["terraform-azurerm-o365dns"]: Refreshing state... [id=terraform-azurerm-o365dns:TF_API_TOKEN]
github_actions_secret.tf_api_token["iac-aws-resources"]: Refreshing state... [id=iac-aws-resources:TF_API_TOKEN]
github_actions_secret.tf_api_token["terraform-azurerm-github-repos"]: Refreshing state... [id=terraform-azurerm-github-repos:TF_API_TOKEN]
module.iac_repos["iac-aws-resources"].github_repository.repo: Refreshing state... [id=iac-aws-resources]
github_actions_secret.tf_api_token["terraform-module-scaffolding"]: Refreshing state... [id=terraform-module-scaffolding:TF_API_TOKEN]
module.ansible_role_kubetools.github_repository.repo: Refreshing state... [id=ansible-role-kubetools]
module.iac_github_mgmt.github_repository.repo: Refreshing state... [id=iac-github-mgmt]
module.ansible_role_docker.github_repository.repo: Refreshing state... [id=ansible-role-docker]
module.ansible_control.github_repository.repo: Refreshing state... [id=ansible-control]
module.azdo_terraform_pipeline_templates.github_repository.repo: Refreshing state... [id=azdo-terraform-pipeline-templates]
module.ansible_role_git.github_repository.repo: Refreshing state... [id=ansible-role-git]
tfe_workspace.iac_repos["iac-aws-resources"]: Refreshing state... [id=ws-reAnP73Hp16sC1VK]
github_user_ssh_key.ssh_key_cultclassik: Refreshing state... [id=54706683]
github_actions_secret.iac_github_mgmt_tftoken: Refreshing state... [id=iac-github-mgmt:TF_API_TOKEN]
tfe_workspace.iac_github_mgmt: Refreshing state... [id=ws-MyypkggTqKQ9xbSY]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_actions_secret.tf_api_token["iac-aws-resources"] has been deleted
  - resource "github_actions_secret" "tf_api_token" {
      - created_at      = "2021-10-06 00:23:04 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "iac-aws-resources:TF_API_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "iac-aws-resources" -> null
      - secret_name     = "TF_API_TOKEN" -> null
      - updated_at      = "2021-10-06 00:23:04 +0000 UTC" -> null
    }
  # tfe_workspace.iac_repos["iac-aws-resources"] has been changed
  ~ resource "tfe_workspace" "iac_repos" {
        id                            = "ws-reAnP73Hp16sC1VK"
        name                          = "iac-aws-resources"
      + remote_state_consumer_ids     = []
      + trigger_prefixes              = []
        # (13 unchanged attributes hidden)
    }
  # module.iac_repos["iac-aws-resources"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ default_branch         = "main" -> "master"
      ~ etag                   = "W/\"2e3689460ea483159aca069c3541c9b25e55004a97797ac44728591ab5d73d33\"" -> "W/\"87ac5b210c4c6071757835a25cdc9a0413a8ea3f408adb68cef4d57fd2749430\""
        id                     = "iac-aws-resources"
        name                   = "iac-aws-resources"
      + topics                 = []
        # (22 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_actions_secret.tf_api_token["iac-aws-resources"] will be created
  + resource "github_actions_secret" "tf_api_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "iac-aws-resources"
      + secret_name     = "TF_API_TOKEN"
      + updated_at      = (known after apply)
    }

  # tfe_workspace.iac_repos["iac-aws-resources"] will be destroyed
  - resource "tfe_workspace" "iac_repos" {
      - allow_destroy_plan            = true -> null
      - auto_apply                    = false -> null
      - description                   = "Terraform code to manage AWS resources" -> null
      - execution_mode                = "local" -> null
      - file_triggers_enabled         = true -> null
      - global_remote_state           = false -> null
      - id                            = "ws-reAnP73Hp16sC1VK" -> null
      - name                          = "iac-aws-resources" -> null
      - operations                    = false -> null
      - organization                  = "Diehlabs" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "prod",
        ] -> null
      - terraform_version             = "1.0.8" -> null
      - trigger_prefixes              = [] -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @CultClassik, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Configuration Run`*